# **Pandas**

## **Introduction to pandas**

In order to make a visualization, we need data and usually need it an organized tabular form suitable for plotting. The pandas library provides easy-to-use data structures and data analysis tools to make your data easier to plot. An important data structure of the pandas library is a fast and efficient object for data manipulation called a `DataFrame`.

![img](https://ichi.pro/assets/images/max/724/1*8F3TgEXSmJ3G4cRkiY56-Q.png)

In order to create visualizations, you first need data to work with.

## **Create sample data**

Car Loan of $34,690 dollars with a 7.02 interest rate over 60 months.

In [1]:
import pandas as pd

In [2]:
# Approach 1 List

car_loans = [[1, 34689.96, 687.23, 202.93, 484.3, 34205.66, 60, 0.0702, 'Toyota Sienna'],
             [2, 34205.66, 687.23, 200.1, 487.13, 33718.53, 60, 0.0702, 'Toyota Sienna'],
             [3, 33718.53, 687.23, 197.25, 489.98, 33228.55, 60, 0.0702, 'Toyota Sienna'],
             [4, 33228.55, 687.23, 194.38, 492.85, 32735.7, 60, 0.0702, 'Toyota Sienna'],
             [5, 32735.7, 687.23, 191.5, 495.73, 32239.97, 60, 0.0702, 'Toyota Sienna']]

col_names = ['Month',
             'Starting Balance',
             'Repayment',
             'Interest Paid',
             'Principal Paid',
             'New Balance',
             'term',
             'interest_rate',
             'car_type']

In [3]:
df = pd.DataFrame(data = car_loans, columns=col_names)

In [4]:
df

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [5]:
import numpy as np

In [6]:
# Approach 2 NumPy Array

car_loans = np.array([[1, 34689.96, 687.23, 202.93, 484.3, 34205.66, 60, 0.0702, 'Toyota Sienna'],
                      [2, 34205.66, 687.23, 200.1, 487.13, 33718.53, 60, 0.0702, 'Toyota Sienna'],
                      [3, 33718.53, 687.23, 197.25, 489.98, 33228.55, 60, 0.0702, 'Toyota Sienna'],
                      [4, 33228.55, 687.23, 194.38, 492.85, 32735.7, 60, 0.0702, 'Toyota Sienna'],
                      [5, 32735.7, 687.23, 191.5, 495.73, 32239.97, 60, 0.0702, 'Toyota Sienna']])

col_names = ['Month',
             'Starting Balance',
             'Repayment',
             'Interest Paid',
             'Principal Paid',
             'New Balance',
             'term',
             'interest_rate',
             'car_type']

In [7]:
df = pd.DataFrame(data = car_loans, columns=col_names)

In [8]:
df

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.3,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.1,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.7,60,0.0702,Toyota Sienna
4,5,32735.7,687.23,191.5,495.73,32239.97,60,0.0702,Toyota Sienna

In [9]:
# Approach 3 Python Dictionary

car_loans = {'Month': {0: 1, 1: 2, 2: 3, 3: 4, 4: 5},
             'Starting Balance': {0: 34689.96, 1: 34205.66, 2: 33718.53, 3: 33228.55, 4: 32735.7},
             'Repayment': {0: 687.23, 1: 687.23, 2: 687.23, 3: 687.23, 4:687.23},
             'Interest Paid': {0: 202.93, 1: 200.1, 2: 197.25, 3: 194.38, 4:191.5},
             'Principal Paid': {0: 484.3, 1: 487.13, 2: 489.98, 3: 492.85, 4:495.73},
             'New Balance': {0: 34205.66, 1: 33718.53, 2: 33228.55, 3: 32735.7, 4:32239.97},
             'term': {0: 60, 1: 60, 2: 60, 3: 60, 4:60},
             'interest_rate': {0: 0.0702, 1: 0.0702, 2: 0.0702, 3: 0.0702, 4:0.0702},
             'car_type': {0: 'Toyota Sienna', 1: 'Toyota Sienna', 2: 'Toyota Sienna', 3: 'Toyota Sienna', 4:'Toyota Sienna'}}

In [10]:
df = pd.DataFrame(data = car_loans, columns=col_names)

In [11]:
df

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

If you have a larger dataset, it doesn't make sense to manually put data into a dataframe.

## **Load Sample Data**

### Load CSV File

In [12]:
# Load car load data from a csv file
filename = 'data/car_financing.csv'
df = pd.read_csv(filename)

In [13]:
df.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

### Load Excel File

In [14]:
filename = 'data/car_financing.xlsx'
df = pd.read_excel(filename)

In [15]:
df.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

## **Basic operations**

After reading the contains into your DataFrame, it's important to examine your data.

**Examining Data**

- Assure data is correctly loaded
- See what data you have
- Check the validity of your data

### Viewing the first and last 5 rows

In [16]:
# Select top N number of records (default = 5)
df.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [17]:
# Select bottom N number of records (default = 5)
df.tail()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
403,56,3951.11,796.01,9.54,786.47,3164.64,60,0.029,VW Golf R
404,57,3164.64,796.01,7.64,788.37,2376.27,60,0.029,VW Golf R
405,58,2376.27,796.01,5.74,790.27,1586.00,60,0.029,VW Golf R
406,59,1586.00,796.01,3.83,792.18,793.82,60,0.029,VW Golf R
407,60,793.82,796.01,1.91,794.10,-0.28,60,0.029,VW Golf R

### Check the column data type

In [18]:
# Check the column data types using the dtypes attribute
df.dtypes

Month                 int64
Starting Balance    float64
Repayment           float64
Interest Paid       float64
Principal Paid      float64
New Balance         float64
term                  int64
interest_rate       float64
car_type             object
dtype: object

In [19]:
# Use the shape attribute to get the number of rows and columns in your dataframe
df.shape

(408, 9)

In [20]:
# The info method gives the column datatypes + number of non-null values
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 408 entries, 0 to 407
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Month             408 non-null    int64
 1   Starting Balance  408 non-null    float64
 2   Repayment         408 non-null    float64
 3   Interest Paid     407 non-null    float64
 4   Principal Paid    408 non-null    float64
 5   New Balance       408 non-null    float64
 6   term              408 non-null    int64
 7   interest_rate     408 non-null    float64
 8   car_type          408 non-null    object
dtypes: float64(6), int64(2), object(1)
memory usage: 28.8+ KB

## **Slicing**

When working with large datasets oftentimes you're only interested in a smaller subset of that data.

- How to select columns in pandas
- How to use slicing operations in pandas

In [21]:
df.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

### Select columns using brackets

With square brackets, you can select one or more columns.

In [22]:
# Select one column using double brackets
df[['car_type']].head()

        car_type
0  Toyota Sienna
1  Toyota Sienna
2  Toyota Sienna
3  Toyota Sienna
4  Toyota Sienna

In [23]:
# Select multiple columns using double brackets
df[['car_type', 'Principal Paid']].head()

        car_type  Principal Paid
0  Toyota Sienna          484.30
1  Toyota Sienna          487.13
2  Toyota Sienna          489.98
3  Toyota Sienna          492.85
4  Toyota Sienna          495.73

In [24]:
# This is a Pandas DataFrame
type(df[['car_type']].head())

pandas.core.frame.DataFrame

In [25]:
# Select one column using single brackets
# This produces a pandas series which is a one-dimensional array which can be labeled
df['car_type'].head()

0    Toyota Sienna
1    Toyota Sienna
2    Toyota Sienna
3    Toyota Sienna
4    Toyota Sienna
Name: car_type, dtype: object

In [26]:
# This is a Pandas DataFrame
type(df['car_type'].head())

pandas.core.series.Series

In [27]:
# Keep in mind that  you can't select multiple columns using single brackets
# This will result in a KeyError
# df['car_type', 'Principal Paid'].head()

### Pandas Slicing

With a pandas series, we can select rows using slicing like this: `series[start_index:end_index]`

The `end_index` is not inclusive. This behavior is very similar to Python lists.

In [28]:
df['car_type']

0      Toyota Sienna
1      Toyota Sienna
2      Toyota Sienna
3      Toyota Sienna
4      Toyota Sienna
           ...
403        VW Golf R
404        VW Golf R
405        VW Golf R
406        VW Golf R
407        VW Golf R
Name: car_type, Length: 408, dtype: object

In [29]:
df['car_type'][0:10]

0    Toyota Sienna
1    Toyota Sienna
2    Toyota Sienna
3    Toyota Sienna
4    Toyota Sienna
5    Toyota Sienna
6    Toyota Sienna
7    Toyota Sienna
8    Toyota Sienna
9    Toyota Sienna
Name: car_type, dtype: object

In [30]:
# Select column using dot notation
# This is not recommended.
df.car_type.head()

0    Toyota Sienna
1    Toyota Sienna
2    Toyota Sienna
3    Toyota Sienna
4    Toyota Sienna
Name: car_type, dtype: object

In [31]:
"""
This won't work as there is a space in the column name.
Dot notation also fails if your column has the same name
of a DataFrame's attributes or methods.
"""
# df.Principal Paid

"\nThis won't work as there is a space in the column name.\nDot notation also fails if your column has the same name\nof a DataFrame's attributes or methods.\n"

In [32]:
df['Principal Paid']

0      484.30
1      487.13
2      489.98
3      492.85
4      495.73
        ...
403    786.47
404    788.37
405    790.27
406    792.18
407    794.10
Name: Principal Paid, Length: 408, dtype: float64

### Selecting Columns using loc

The pandas attributes `.loc` allow you to select columns, index, and slice your data.

In [33]:
# pandas dataframe
df.loc[:, ['car_type']].head()

        car_type
0  Toyota Sienna
1  Toyota Sienna
2  Toyota Sienna
3  Toyota Sienna
4  Toyota Sienna

In [34]:
# pandas series
df.loc[:, 'car_type'].head()

0    Toyota Sienna
1    Toyota Sienna
2    Toyota Sienna
3    Toyota Sienna
4    Toyota Sienna
Name: car_type, dtype: object

## **Filtering Data**

Filter out the data to only have data `car_type` of 'Toyota Sienna'.

In [35]:
df.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [36]:
# Let's first start by looking at the car_type column.
df['car_type'].value_counts()

VW Golf R         144
Toyota Sienna     120
Toyota Carolla    111
Toyota Corolla     33
Name: car_type, dtype: int64

In [37]:
# Notice that the filter produces a pandas series of True and False values
car_filter = df['car_type'] == 'Toyota Sienna'

In [38]:
car_filter.head()

0    True
1    True
2    True
3    True
4    True
Name: car_type, dtype: bool

In [39]:
# Approach 1 using square brackets
# Filter dataframe to get a DataFrame for only 'Toyota Sienna'
df[car_filter].head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [40]:
# Approach 2 using loc
# Filter dataframe to get a DataFrame for only ''Toyota Sienna'
df.loc[car_filter, :].head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [41]:
# Notice that it looks like nothing changed
# This is because we didn't update the dataframe after applying the filter
df['car_type'].value_counts()

VW Golf R         144
Toyota Sienna     120
Toyota Carolla    111
Toyota Corolla     33
Name: car_type, dtype: int64

In [42]:
# Filter dataframe to get a DataFrame for only 'Toyota Sienna'
df = df.loc[car_filter, :]

In [43]:
df['car_type'].value_counts()

Toyota Sienna    120
Name: car_type, dtype: int64

### Combining Filters

In [44]:
interest_filter  = df['interest_rate'] == 0.0702
car_filter = df['car_type'] == 'Toyota Sienna'

In [45]:
df.loc[car_filter & interest_filter, :].head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

## **Renaming and deleting columns**

**Managing Columns**

- Change column names
- Remove unnecessary columns

**Rename columns**

Here are two popular ways to rename dataframe columns:

1. **dictionary substitution:** very useful if you only want to rename a few of the columns.
2. **list replacement:** requires a full list of names.

In [46]:
# DataFrame before renaming columns
df.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [47]:
# df.Principal Paid
# This won't work as there is a space in the column name
# I want to fix that
df = df.rename(columns={'Starting Balance': 'starting_balance',
                        'Interest Paid': 'interest_paid',
                        'Principal Paid': 'principal_paid',
                        'New Balance': 'new_balance'})

In [48]:
df.head()

,Month,starting_balance,Repayment,interest_paid,principal_paid,new_balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [49]:
# Approach 2 List replacement
# Only changing Month -> month, but we need to list the rest of the columns
df.columns = ['month',
              'starting_balance',
              'Repayment',
              'interest_paid',
              'principal_paid',
              'new_balance',
              'term',
              'interest_rate',
              'car_type']

In [50]:
df.head()

,month,starting_balance,Repayment,interest_paid,principal_paid,new_balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

### Deleting Columns

In [51]:
# Approach 1
# This approach allows you to drop multiple columns at a time
df = df.drop(columns=['term'])

In [52]:
df.head()

,month,starting_balance,Repayment,interest_paid,principal_paid,new_balance,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,0.0702,Toyota Sienna

In [53]:
# Approach 2 use the del command
del df['Repayment']

In [54]:
df.head()

,month,starting_balance,interest_paid,principal_paid,new_balance,interest_rate,car_type
0,1,34689.96,202.93,484.30,34205.66,0.0702,Toyota Sienna
1,2,34205.66,200.10,487.13,33718.53,0.0702,Toyota Sienna
2,3,33718.53,197.25,489.98,33228.55,0.0702,Toyota Sienna
3,4,33228.55,194.38,492.85,32735.70,0.0702,Toyota Sienna
4,5,32735.70,191.50,495.73,32239.97,0.0702,Toyota Sienna

## **Aggregate Functions**

When working with a dataset it's a good idea to compute summary statistics.

In [55]:
df.head()

,month,starting_balance,interest_paid,principal_paid,new_balance,interest_rate,car_type
0,1,34689.96,202.93,484.30,34205.66,0.0702,Toyota Sienna
1,2,34205.66,200.10,487.13,33718.53,0.0702,Toyota Sienna
2,3,33718.53,197.25,489.98,33228.55,0.0702,Toyota Sienna
3,4,33228.55,194.38,492.85,32735.70,0.0702,Toyota Sienna
4,5,32735.70,191.50,495.73,32239.97,0.0702,Toyota Sienna

In [56]:
# sum the values in a column
# total amount of interest paid over the course of the loan
df['interest_paid'].sum()

9708.15

In [57]:
# sum all the values across all columns
df.sum()

month                                                            3660
starting_balance                                           2207694.02
interest_paid                                                 9708.15
principal_paid                                               69380.61
new_balance                                                2138313.41
interest_rate                                                   6.366
car_type            Toyota SiennaToyota SiennaToyota SiennaToyota ...
dtype: object

In [58]:
'Toyota Sienna' + 'Toyota Sienna'

'Toyota SiennaToyota Sienna'

In [59]:
# Notice that by default it seems like the sum function ignores missing values.
help(df['interest_paid'].sum)

Help on method sum in module pandas.core.generic:

sum(axis=None, skipna=None, level=None, numeric_only=None, min_count=0, **kwargs) method of pandas.core.series.Series instance
    Return the sum of the values over the requested axis.

    This is equivalent to the method ``numpy.sum``.

    Parameters
    ----------
    axis : {index (0)}
        Axis for the function to be applied on.
    skipna : bool, default True
        Exclude NA/null values when computing the result.
    level : int or level name, default None
        If the axis is a MultiIndex (hierarchical), count along a
        particular level, collapsing into a scalar.
    numeric_only : bool, default None
        Include only float, int, boolean columns. If None, will attempt to use
        everything, then use only numeric data. Not implemented for Series.
    min_count : int, default 0
        The required number of valid values to perform the operation. If fewer than
        ``min_count`` non-NA values are present the result will be NA.
    **kwargs
        Additional keyword arguments to be passed to the function.

    Returns
    -------
    scalar or Series (if level specified)

    See Also
    --------
    Series.sum : Return the sum.
    Series.min : Return the minimum.
    Series.max : Return the maximum.
    Series.idxmin : Return the index of the minimum.
    Series.idxmax : Return the index of the maximum.
    DataFrame.sum : Return the sum over the requested axis.
    DataFrame.min : Return the minimum over the requested axis.
    DataFrame.max : Return the maximum over the requested axis.
    DataFrame.idxmin : Return the index of the minimum over the requested axis.
    DataFrame.idxmax : Return the index of the maximum over the requested axis.

    Examples
    --------
    >>> idx = pd.MultiIndex.from_arrays([
    ...     ['warm', 'warm', 'cold', 'cold'],
    ...     ['dog', 'falcon', 'fish', 'spider']],
    ...     names=['blooded', 'animal'])
    >>> s = pd.Series([4, 2, 0, 8], name='legs', index=idx)
    >>> s
    blooded  animal
    warm     dog       4
             falcon    2
    cold     fish      0
             spider    8
    Name: legs, dtype: int64

    >>> s.sum()
    14

    Sum using level names, as well as indices.

    >>> s.sum(level='blooded')
    blooded
    warm    6
    cold    8
    Name: legs, dtype: int64

    >>> s.sum(level=0)
    blooded
    warm    6
    cold    8
    Name: legs, dtype: int64

    By default, the sum of an empty or all-NA Series is ``0``.

    >>> pd.Series([]).sum()  # min_count=0 is the default
    0.0

    This can be controlled with the ``min_count`` parameter. For example, if
    you'd like the sum of an empty series to be NaN, pass ``min_count=1``.

    >>> pd.Series([]).sum(min_count=1)
    nan

    Thanks to the ``skipna`` parameter, ``min_count`` handles all-NA and
    empty series identically.

    >>> pd.Series([np.nan]).sum()
    0.0

    >>> pd.Series([np.nan]).sum(min_count=1)
    nan

In [60]:
# The info method gives the column datatypes + number of non-null values
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 120 entries, 0 to 119
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   month             120 non-null    int64
 1   starting_balance  120 non-null    float64
 2   interest_paid     119 non-null    float64
 3   principal_paid    120 non-null    float64
 4   new_balance       120 non-null    float64
 5   interest_rate     120 non-null    float64
 6   car_type          120 non-null    object
dtypes: float64(5), int64(1), object(1)
memory usage: 7.5+ KB

In [61]:
# Pandas describe() is used to view some basic statistical details
df.describe()

,month,starting_balance,interest_paid,principal_paid,new_balance,interest_rate
count,120.000000,120.000000,119.000000,120.000000,120.000000,120.000000
mean,30.500000,18397.450167,81.581092,578.171750,17819.278417,0.053050
std,17.390715,10029.255053,54.284675,46.553384,10073.545079,0.017222
min,1.000000,630.230000,1.880000,484.300000,-0.360000,0.035900
25%,15.750000,9860.202500,38.690000,543.940000,9250.567500,0.035900
50%,30.500000,18778.295000,72.900000,576.725000,18201.570000,0.053050
75%,45.250000,27125.887500,111.995000,611.677500,26591.405000,0.070200
max,60.000000,34689.960000,202.930000,683.240000,34205.660000,0.070200

## **Identifying missing data**

When working with a dataset you will often run into missing values. Before you can graph data, you need to be sure there are no missing values.

### Identifying missing data

Values will be originally missing from a dataset or be a product of data manipulation. In pandas, missing values are typically called `NaN` or `None`.

Missing data can be:
- Hint at data collection errors.
- Indicate improper conversion or manipulation.
- Actually not be considered missing. For some datasets, missing data can be listed as "zero", "false", "not applicable", "entered an empty string", among other possibilities.

### Finding missing values

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 120 entries, 0 to 119
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   month             120 non-null    int64
 1   starting_balance  120 non-null    float64
 2   interest_paid     119 non-null    float64
 3   principal_paid    120 non-null    float64
 4   new_balance       120 non-null    float64
 5   interest_rate     120 non-null    float64
 6   car_type          120 non-null    object
dtypes: float64(5), int64(1), object(1)
memory usage: 7.5+ KB

Two common methods to indicate where values in a DataFrame are missing are `isna` and `isnull`.

In [63]:
# Notice we have a Pandas Series of True and False values
df['interest_paid'].isna().head()

0    False
1    False
2    False
3    False
4    False
Name: interest_paid, dtype: bool

In [64]:
# Number of missing values
df['interest_paid'].isna().sum()

1

In [65]:
# Looks at the row that contains the NaN for interested_paid
df.loc[df['interest_paid'].isna(), :]

,month,starting_balance,interest_paid,principal_paid,new_balance,interest_rate,car_type
35,36,15940.06,NaN,593.99,15346.07,0.0702,Toyota Sienna

In [66]:
# Keep in mind that we can use the not operator (~) to negate the filter every row that doesn't have a nan is returned.
df.loc[~df['interest_paid'].isna(), :].head()

,month,starting_balance,interest_paid,principal_paid,new_balance,interest_rate,car_type
0,1,34689.96,202.93,484.30,34205.66,0.0702,Toyota Sienna
1,2,34205.66,200.10,487.13,33718.53,0.0702,Toyota Sienna
2,3,33718.53,197.25,489.98,33228.55,0.0702,Toyota Sienna
3,4,33228.55,194.38,492.85,32735.70,0.0702,Toyota Sienna
4,5,32735.70,191.50,495.73,32239.97,0.0702,Toyota Sienna

## **Remove of Fill Missing Data**

This is an important subject as before you can graph data, you should make sure you aren't trying to graph some missing values as that can cause an error or misinterpretation of the data.

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 120 entries, 0 to 119
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   month             120 non-null    int64
 1   starting_balance  120 non-null    float64
 2   interest_paid     119 non-null    float64
 3   principal_paid    120 non-null    float64
 4   new_balance       120 non-null    float64
 5   interest_rate     120 non-null    float64
 6   car_type          120 non-null    object
dtypes: float64(5), int64(1), object(1)
memory usage: 7.5+ KB

### Remove Missing Values
You can remove missing values by using `dropna` method.

In [68]:
# You can drop entire rows if they contain 'any' nans in them or 'all'
# this may not be the best strategy for our dataset
df[30:40].dropna(how = 'any')

,month,starting_balance,interest_paid,principal_paid,new_balance,interest_rate,car_type
30,31,18858.57,110.32,576.91,18281.66,0.0702,Toyota Sienna
31,32,18281.66,106.94,580.29,17701.37,0.0702,Toyota Sienna
32,33,17701.37,103.55,583.68,17117.69,0.0702,Toyota Sienna
33,34,17117.69,100.13,587.10,16530.59,0.0702,Toyota Sienna
34,35,16530.59,96.70,590.53,15940.06,0.0702,Toyota Sienna
36,37,15346.07,89.77,597.46,14748.61,0.0702,Toyota Sienna
37,38,14748.61,86.27,600.96,14147.65,0.0702,Toyota Sienna
38,39,14147.65,82.76,604.47,13543.18,0.0702,Toyota Sienna
39,40,13543.18,79.22,608.01,12935.17,0.0702,Toyota Sienna

### Filling in missing values
There are a variety of ways to fill in missing values.

In [69]:
# Looking at where missing data is located
df['interest_paid'][30:40]

30    110.32
31    106.94
32    103.55
33    100.13
34     96.70
35       NaN
36     89.77
37     86.27
38     82.76
39     79.22
Name: interest_paid, dtype: float64

In [70]:
# Filling in the nan with a zero is probably a bad idea.
df['interest_paid'][30:40].fillna(0)

30    110.32
31    106.94
32    103.55
33    100.13
34     96.70
35      0.00
36     89.77
37     86.27
38     82.76
39     79.22
Name: interest_paid, dtype: float64

In [71]:
# back fill in value
df['interest_paid'][30:40].fillna(method='bfill')

30    110.32
31    106.94
32    103.55
33    100.13
34     96.70
35     89.77
36     89.77
37     86.27
38     82.76
39     79.22
Name: interest_paid, dtype: float64

In [72]:
# forward fill in value
df['interest_paid'][30:40].fillna(method='ffill')

30    110.32
31    106.94
32    103.55
33    100.13
34     96.70
35     96.70
36     89.77
37     86.27
38     82.76
39     79.22
Name: interest_paid, dtype: float64

In [73]:
# linear interpolation (filling in of values)
df['interest_paid'][30:40].interpolate(method='linear')

30    110.320
31    106.940
32    103.550
33    100.130
34     96.700
35     93.235
36     89.770
37     86.270
38     82.760
39     79.220
Name: interest_paid, dtype: float64

In [74]:
# Interest paid before filling in the nan with a value
df['interest_paid'].sum()

9708.15

In [75]:
# Fill in with the actual value
interest_missing = df['interest_paid'].isna()
df.loc[interest_missing, 'interest_paid'] = 93.24

In [76]:
# Interest paid after filling in the nan with a value
df['interest_paid'].sum()

9801.39

In [77]:
# Notice we don't have NaN values in the DataFrame anymore
df.info(0)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 120 entries, 0 to 119
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   month             120 non-null    int64
 1   starting_balance  120 non-null    float64
 2   interest_paid     120 non-null    float64
 3   principal_paid    120 non-null    float64
 4   new_balance       120 non-null    float64
 5   interest_rate     120 non-null    float64
 6   car_type          120 non-null    object
dtypes: float64(5), int64(1), object(1)
memory usage: 7.5+ KB

## **Converting DataFrames**

Certain libraries prefer NumPy arrays or dictionaries as inputs to their methods.

In [78]:
df.head()

,month,starting_balance,interest_paid,principal_paid,new_balance,interest_rate,car_type
0,1,34689.96,202.93,484.30,34205.66,0.0702,Toyota Sienna
1,2,34205.66,200.10,487.13,33718.53,0.0702,Toyota Sienna
2,3,33718.53,197.25,489.98,33228.55,0.0702,Toyota Sienna
3,4,33228.55,194.38,492.85,32735.70,0.0702,Toyota Sienna
4,5,32735.70,191.50,495.73,32239.97,0.0702,Toyota Sienna

### Convert Pandas DataFrames to NumPy Arrays

In [79]:
# Approach 1
df.to_numpy()

array([[1, 34689.96, 202.93, 484.3, 34205.66, 0.0702, 'Toyota Sienna'],
       [2, 34205.66, 200.1, 487.13, 33718.53, 0.0702, 'Toyota Sienna'],
       [3, 33718.53, 197.25, 489.98, 33228.55, 0.0702, 'Toyota Sienna'],
       [4, 33228.55, 194.38, 492.85, 32735.7, 0.0702, 'Toyota Sienna'],
       [5, 32735.7, 191.5, 495.73, 32239.97, 0.0702, 'Toyota Sienna'],
       [6, 32239.97, 188.6, 498.63, 31741.34, 0.0702, 'Toyota Sienna'],
       [7, 31741.34, 185.68, 501.55, 31239.79, 0.0702, 'Toyota Sienna'],
       [8, 31239.79, 182.75, 504.48, 30735.31, 0.0702, 'Toyota Sienna'],
       [9, 30735.31, 179.8, 507.43, 30227.88, 0.0702, 'Toyota Sienna'],
       [10, 30227.88, 176.83, 510.4, 29717.48, 0.0702, 'Toyota Sienna'],
       [11, 29717.48, 173.84, 513.39, 29204.09, 0.0702, 'Toyota Sienna'],
       [12, 29204.09, 170.84, 516.39, 28687.7, 0.0702, 'Toyota Sienna'],
       [13, 28687.7, 167.82, 519.41, 28168.29, 0.0702, 'Toyota Sienna'],
       [14, 28168.29, 164.78, 522.45, 27645.84, 0.0702, 'Toyota Sienna'],
       [15, 27645.84, 161.72, 525.51, 27120.33, 0.0702, 'Toyota Sienna'],
       [16, 27120.33, 158.65, 528.58, 26591.75, 0.0702, 'Toyota Sienna'],
       [17, 26591.75, 155.56, 531.67, 26060.08, 0.0702, 'Toyota Sienna'],
       [18, 26060.08, 152.45, 534.78, 25525.3, 0.0702, 'Toyota Sienna'],
       [19, 25525.3, 149.32, 537.91, 24987.39, 0.0702, 'Toyota Sienna'],
       [20, 24987.39, 146.17, 541.06, 24446.33, 0.0702, 'Toyota Sienna'],
       [21, 24446.33, 143.01, 544.22, 23902.11, 0.0702, 'Toyota Sienna'],
       [22, 23902.11, 139.82, 547.41, 23354.7, 0.0702, 'Toyota Sienna'],
       [23, 23354.7, 136.62, 550.61, 22804.09, 0.0702, 'Toyota Sienna'],
       [24, 22804.09, 133.4, 553.83, 22250.26, 0.0702, 'Toyota Sienna'],
       [25, 22250.26, 130.16, 557.07, 21693.19, 0.0702, 'Toyota Sienna'],
       [26, 21693.19, 126.9, 560.33, 21132.86, 0.0702, 'Toyota Sienna'],
       [27, 21132.86, 123.62, 563.61, 20569.25, 0.0702, 'Toyota Sienna'],
       [28, 20569.25, 120.33, 566.9, 20002.35, 0.0702, 'Toyota Sienna'],
       [29, 20002.35, 117.01, 570.22, 19432.13, 0.0702, 'Toyota Sienna'],
       [30, 19432.13, 113.67, 573.56, 18858.57, 0.0702, 'Toyota Sienna'],
       [31, 18858.57, 110.32, 576.91, 18281.66, 0.0702, 'Toyota Sienna'],
       [32, 18281.66, 106.94, 580.29, 17701.37, 0.0702, 'Toyota Sienna'],
       [33, 17701.37, 103.55, 583.68, 17117.69, 0.0702, 'Toyota Sienna'],
       [34, 17117.69, 100.13, 587.1, 16530.59, 0.0702, 'Toyota Sienna'],
       [35, 16530.59, 96.7, 590.53, 15940.06, 0.0702, 'Toyota Sienna'],
       [36, 15940.06, 93.24, 593.99, 15346.07, 0.0702, 'Toyota Sienna'],
       [37, 15346.07, 89.77, 597.46, 14748.61, 0.0702, 'Toyota Sienna'],
       [38, 14748.61, 86.27, 600.96, 14147.65, 0.0702, 'Toyota Sienna'],
       [39, 14147.65, 82.76, 604.47, 13543.18, 0.0702, 'Toyota Sienna'],
       [40, 13543.18, 79.22, 608.01, 12935.17, 0.0702, 'Toyota Sienna'],
       [41, 12935.17, 75.67, 611.56, 12323.61, 0.0702, 'Toyota Sienna'],
       [42, 12323.61, 72.09, 615.14, 11708.47, 0.0702, 'Toyota Sienna'],
       [43, 11708.47, 68.49, 618.74, 11089.73, 0.0702, 'Toyota Sienna'],
       [44, 11089.73, 64.87, 622.36, 10467.37, 0.0702, 'Toyota Sienna'],
       [45, 10467.37, 61.23, 626.0, 9841.37, 0.0702, 'Toyota Sienna'],
       [46, 9841.37, 57.57, 629.66, 9211.71, 0.0702, 'Toyota Sienna'],
       [47, 9211.71, 53.88, 633.35, 8578.36, 0.0702, 'Toyota Sienna'],
       [48, 8578.36, 50.18, 637.05, 7941.31, 0.0702, 'Toyota Sienna'],
       [49, 7941.31, 46.45, 640.78, 7300.53, 0.0702, 'Toyota Sienna'],
       [50, 7300.53, 42.7, 644.53, 6656.0, 0.0702, 'Toyota Sienna'],
       [51, 6656.0, 38.93, 648.3, 6007.7, 0.0702, 'Toyota Sienna'],
       [52, 6007.7, 35.14, 652.09, 5355.61, 0.0702, 'Toyota Sienna'],
       [53, 5355.61, 31.33, 655.9, 4699.71, 0.0702, 'Toyota Sienna'],
       [54, 4699.71, 27.49, 659.74, 4039.97, 0.0702, 'Toyota Sienna'],
       [55, 4039.97, 23.63, 663.6, 3376.37, 0.0702, 'Toyota Sienna'],
       [56, 3376.37, 19.75, 667.48, 2708.89, 0.0702, 'Toyota Sienna'],
       [57, 2708.89, 15.84, 671.39, 2037.5, 0.0702, 'Toyota Sienna'],
       [58, 2037.5, 11.91, 675.32, 1362.18, 0.0702, 'Toyota Sienna'],
       [59, 1362.18, 7.96, 679.27, 682.91, 0.0702, 'Toyota Sienna'],
       [60, 682.91, 3.99, 683.24, -0.33, 0.0702, 'Toyota Sienna'],
       [1, 34689.96, 103.78, 528.69, 34161.27, 0.0359, 'Toyota Sienna'],
       [2, 34161.27, 102.19, 530.28, 33630.99, 0.0359, 'Toyota Sienna'],
       [3, 33630.99, 100.61, 531.86, 33099.13, 0.0359, 'Toyota Sienna'],
       [4, 33099.13, 99.02, 533.45, 32565.68, 0.0359, 'Toyota Sienna'],
       [5, 32565.68, 97.42, 535.05, 32030.63, 0.0359, 'Toyota Sienna'],
       [6, 32030.63, 95.82, 536.65, 31493.98, 0.0359, 'Toyota Sienna'],
       [7, 31493.98, 94.21, 538.26, 30955.72, 0.0359, 'Toyota Sienna'],
       [8, 30955.72, 92.6, 539.87, 30415.85, 0.0359, 'Toyota Sienna'],
       [9, 30415.85, 90.99, 541.48, 29874.37, 0.0359, 'Toyota Sienna'],
       [10, 29874.37, 89.37, 543.1, 29331.27, 0.0359, 'Toyota Sienna'],
       [11, 29331.27, 87.74, 544.73, 28786.54, 0.0359, 'Toyota Sienna'],
       [12, 28786.54, 86.11, 546.36, 28240.18, 0.0359, 'Toyota Sienna'],
       [13, 28240.18, 84.48, 547.99, 27692.19, 0.0359, 'Toyota Sienna'],
       [14, 27692.19, 82.84, 549.63, 27142.56, 0.0359, 'Toyota Sienna'],
       [15, 27142.56, 81.2, 551.27, 26591.29, 0.0359, 'Toyota Sienna'],
       [16, 26591.29, 79.55, 552.92, 26038.37, 0.0359, 'Toyota Sienna'],
       [17, 26038.37, 77.89, 554.58, 25483.79, 0.0359, 'Toyota Sienna'],
       [18, 25483.79, 76.23, 556.24, 24927.55, 0.0359, 'Toyota Sienna'],
       [19, 24927.55, 74.57, 557.9, 24369.65, 0.0359, 'Toyota Sienna'],
       [20, 24369.65, 72.9, 559.57, 23810.08, 0.0359, 'Toyota Sienna'],
       [21, 23810.08, 71.23, 561.24, 23248.84, 0.0359, 'Toyota Sienna'],
       [22, 23248.84, 69.55, 562.92, 22685.92, 0.0359, 'Toyota Sienna'],
       [23, 22685.92, 67.86, 564.61, 22121.31, 0.0359, 'Toyota Sienna'],
       [24, 22121.31, 66.17, 566.3, 21555.01, 0.0359, 'Toyota Sienna'],
       [25, 21555.01, 64.48, 567.99, 20987.02, 0.0359, 'Toyota Sienna'],
       [26, 20987.02, 62.78, 569.69, 20417.33, 0.0359, 'Toyota Sienna'],
       [27, 20417.33, 61.08, 571.39, 19845.94, 0.0359, 'Toyota Sienna'],
       [28, 19845.94, 59.37, 573.1, 19272.84, 0.0359, 'Toyota Sienna'],
       [29, 19272.84, 57.65, 574.82, 18698.02, 0.0359, 'Toyota Sienna'],
       [30, 18698.02, 55.93, 576.54, 18121.48, 0.0359, 'Toyota Sienna'],
       [31, 18121.48, 54.21, 578.26, 17543.22, 0.0359, 'Toyota Sienna'],
       [32, 17543.22, 52.48, 579.99, 16963.23, 0.0359, 'Toyota Sienna'],
       [33, 16963.23, 50.74, 581.73, 16381.5, 0.0359, 'Toyota Sienna'],
       [34, 16381.5, 49.0, 583.47, 15798.03, 0.0359, 'Toyota Sienna'],
       [35, 15798.03, 47.26, 585.21, 15212.82, 0.0359, 'Toyota Sienna'],
       [36, 15212.82, 45.51, 586.96, 14625.86, 0.0359, 'Toyota Sienna'],
       [37, 14625.86, 43.75, 588.72, 14037.14, 0.0359, 'Toyota Sienna'],
       [38, 14037.14, 41.99, 590.48, 13446.66, 0.0359, 'Toyota Sienna'],
       [39, 13446.66, 40.22, 592.25, 12854.41, 0.0359, 'Toyota Sienna'],
       [40, 12854.41, 38.45, 594.02, 12260.39, 0.0359, 'Toyota Sienna'],
       [41, 12260.39, 36.67, 595.8, 11664.59, 0.0359, 'Toyota Sienna'],
       [42, 11664.59, 34.89, 597.58, 11067.01, 0.0359, 'Toyota Sienna'],
       [43, 11067.01, 33.1, 599.37, 10467.64, 0.0359, 'Toyota Sienna'],
       [44, 10467.64, 31.31, 601.16, 9866.48, 0.0359, 'Toyota Sienna'],
       [45, 9866.48, 29.51, 602.96, 9263.52, 0.0359, 'Toyota Sienna'],
       [46, 9263.52, 27.71, 604.76, 8658.76, 0.0359, 'Toyota Sienna'],
       [47, 8658.76, 25.9, 606.57, 8052.19, 0.0359, 'Toyota Sienna'],
       [48, 8052.19, 24.08, 608.39, 7443.8, 0.0359, 'Toyota Sienna'],
       [49, 7443.8, 22.26, 610.21, 6833.59, 0.0359, 'Toyota Sienna'],
       [50, 6833.59, 20.44, 612.03, 6221.56, 0.0359, 'Toyota Sienna'],
       [51, 6221.56, 18.61, 613.86, 5607.7, 0.0359, 'Toyota Sienna'],
       [52, 5607.7, 16.77, 615.7, 4992.0, 0.0359, 'Toyota Sienna'],
       [53, 4992.0, 14.93, 617.54, 4374.46, 0.0359, 'Toyota Sienna'],
       [54, 4374.46, 13.08, 619.39, 3755.07, 0.0359, 'Toyota Sienna'],
       [55, 3755.07, 11.23, 621.24, 3133.83, 0.0359, 'Toyota Sienna'],
       [56, 3133.83, 9.37, 623.1, 2510.73, 0.0359, 'Toyota Sienna'],
       [57, 2510.73, 7.51, 624.96, 1885.77, 0.0359, 'Toyota Sienna'],
       [58, 1885.77, 5.64, 626.83, 1258.94, 0.0359, 'Toyota Sienna'],
       [59, 1258.94, 3.76, 628.71, 630.23, 0.0359, 'Toyota Sienna'],
       [60, 630.23, 1.88, 630.59, -0.36, 0.0359, 'Toyota Sienna']],
      dtype=object)

In [80]:
# Approach 2
df.values

array([[1, 34689.96, 202.93, 484.3, 34205.66, 0.0702, 'Toyota Sienna'],
       [2, 34205.66, 200.1, 487.13, 33718.53, 0.0702, 'Toyota Sienna'],
       [3, 33718.53, 197.25, 489.98, 33228.55, 0.0702, 'Toyota Sienna'],
       [4, 33228.55, 194.38, 492.85, 32735.7, 0.0702, 'Toyota Sienna'],
       [5, 32735.7, 191.5, 495.73, 32239.97, 0.0702, 'Toyota Sienna'],
       [6, 32239.97, 188.6, 498.63, 31741.34, 0.0702, 'Toyota Sienna'],
       [7, 31741.34, 185.68, 501.55, 31239.79, 0.0702, 'Toyota Sienna'],
       [8, 31239.79, 182.75, 504.48, 30735.31, 0.0702, 'Toyota Sienna'],
       [9, 30735.31, 179.8, 507.43, 30227.88, 0.0702, 'Toyota Sienna'],
       [10, 30227.88, 176.83, 510.4, 29717.48, 0.0702, 'Toyota Sienna'],
       [11, 29717.48, 173.84, 513.39, 29204.09, 0.0702, 'Toyota Sienna'],
       [12, 29204.09, 170.84, 516.39, 28687.7, 0.0702, 'Toyota Sienna'],
       [13, 28687.7, 167.82, 519.41, 28168.29, 0.0702, 'Toyota Sienna'],
       [14, 28168.29, 164.78, 522.45, 27645.84, 0.0702, 'Toyota Sienna'],
       [15, 27645.84, 161.72, 525.51, 27120.33, 0.0702, 'Toyota Sienna'],
       [16, 27120.33, 158.65, 528.58, 26591.75, 0.0702, 'Toyota Sienna'],
       [17, 26591.75, 155.56, 531.67, 26060.08, 0.0702, 'Toyota Sienna'],
       [18, 26060.08, 152.45, 534.78, 25525.3, 0.0702, 'Toyota Sienna'],
       [19, 25525.3, 149.32, 537.91, 24987.39, 0.0702, 'Toyota Sienna'],
       [20, 24987.39, 146.17, 541.06, 24446.33, 0.0702, 'Toyota Sienna'],
       [21, 24446.33, 143.01, 544.22, 23902.11, 0.0702, 'Toyota Sienna'],
       [22, 23902.11, 139.82, 547.41, 23354.7, 0.0702, 'Toyota Sienna'],
       [23, 23354.7, 136.62, 550.61, 22804.09, 0.0702, 'Toyota Sienna'],
       [24, 22804.09, 133.4, 553.83, 22250.26, 0.0702, 'Toyota Sienna'],
       [25, 22250.26, 130.16, 557.07, 21693.19, 0.0702, 'Toyota Sienna'],
       [26, 21693.19, 126.9, 560.33, 21132.86, 0.0702, 'Toyota Sienna'],
       [27, 21132.86, 123.62, 563.61, 20569.25, 0.0702, 'Toyota Sienna'],
       [28, 20569.25, 120.33, 566.9, 20002.35, 0.0702, 'Toyota Sienna'],
       [29, 20002.35, 117.01, 570.22, 19432.13, 0.0702, 'Toyota Sienna'],
       [30, 19432.13, 113.67, 573.56, 18858.57, 0.0702, 'Toyota Sienna'],
       [31, 18858.57, 110.32, 576.91, 18281.66, 0.0702, 'Toyota Sienna'],
       [32, 18281.66, 106.94, 580.29, 17701.37, 0.0702, 'Toyota Sienna'],
       [33, 17701.37, 103.55, 583.68, 17117.69, 0.0702, 'Toyota Sienna'],
       [34, 17117.69, 100.13, 587.1, 16530.59, 0.0702, 'Toyota Sienna'],
       [35, 16530.59, 96.7, 590.53, 15940.06, 0.0702, 'Toyota Sienna'],
       [36, 15940.06, 93.24, 593.99, 15346.07, 0.0702, 'Toyota Sienna'],
       [37, 15346.07, 89.77, 597.46, 14748.61, 0.0702, 'Toyota Sienna'],
       [38, 14748.61, 86.27, 600.96, 14147.65, 0.0702, 'Toyota Sienna'],
       [39, 14147.65, 82.76, 604.47, 13543.18, 0.0702, 'Toyota Sienna'],
       [40, 13543.18, 79.22, 608.01, 12935.17, 0.0702, 'Toyota Sienna'],
       [41, 12935.17, 75.67, 611.56, 12323.61, 0.0702, 'Toyota Sienna'],
       [42, 12323.61, 72.09, 615.14, 11708.47, 0.0702, 'Toyota Sienna'],
       [43, 11708.47, 68.49, 618.74, 11089.73, 0.0702, 'Toyota Sienna'],
       [44, 11089.73, 64.87, 622.36, 10467.37, 0.0702, 'Toyota Sienna'],
       [45, 10467.37, 61.23, 626.0, 9841.37, 0.0702, 'Toyota Sienna'],
       [46, 9841.37, 57.57, 629.66, 9211.71, 0.0702, 'Toyota Sienna'],
       [47, 9211.71, 53.88, 633.35, 8578.36, 0.0702, 'Toyota Sienna'],
       [48, 8578.36, 50.18, 637.05, 7941.31, 0.0702, 'Toyota Sienna'],
       [49, 7941.31, 46.45, 640.78, 7300.53, 0.0702, 'Toyota Sienna'],
       [50, 7300.53, 42.7, 644.53, 6656.0, 0.0702, 'Toyota Sienna'],
       [51, 6656.0, 38.93, 648.3, 6007.7, 0.0702, 'Toyota Sienna'],
       [52, 6007.7, 35.14, 652.09, 5355.61, 0.0702, 'Toyota Sienna'],
       [53, 5355.61, 31.33, 655.9, 4699.71, 0.0702, 'Toyota Sienna'],
       [54, 4699.71, 27.49, 659.74, 4039.97, 0.0702, 'Toyota Sienna'],
       [55, 4039.97, 23.63, 663.6, 3376.37, 0.0702, 'Toyota Sienna'],
       [56, 3376.37, 19.75, 667.48, 2708.89, 0.0702, 'Toyota Sienna'],
       [57, 2708.89, 15.84, 671.39, 2037.5, 0.0702, 'Toyota Sienna'],
       [58, 2037.5, 11.91, 675.32, 1362.18, 0.0702, 'Toyota Sienna'],
       [59, 1362.18, 7.96, 679.27, 682.91, 0.0702, 'Toyota Sienna'],
       [60, 682.91, 3.99, 683.24, -0.33, 0.0702, 'Toyota Sienna'],
       [1, 34689.96, 103.78, 528.69, 34161.27, 0.0359, 'Toyota Sienna'],
       [2, 34161.27, 102.19, 530.28, 33630.99, 0.0359, 'Toyota Sienna'],
       [3, 33630.99, 100.61, 531.86, 33099.13, 0.0359, 'Toyota Sienna'],
       [4, 33099.13, 99.02, 533.45, 32565.68, 0.0359, 'Toyota Sienna'],
       [5, 32565.68, 97.42, 535.05, 32030.63, 0.0359, 'Toyota Sienna'],
       [6, 32030.63, 95.82, 536.65, 31493.98, 0.0359, 'Toyota Sienna'],
       [7, 31493.98, 94.21, 538.26, 30955.72, 0.0359, 'Toyota Sienna'],
       [8, 30955.72, 92.6, 539.87, 30415.85, 0.0359, 'Toyota Sienna'],
       [9, 30415.85, 90.99, 541.48, 29874.37, 0.0359, 'Toyota Sienna'],
       [10, 29874.37, 89.37, 543.1, 29331.27, 0.0359, 'Toyota Sienna'],
       [11, 29331.27, 87.74, 544.73, 28786.54, 0.0359, 'Toyota Sienna'],
       [12, 28786.54, 86.11, 546.36, 28240.18, 0.0359, 'Toyota Sienna'],
       [13, 28240.18, 84.48, 547.99, 27692.19, 0.0359, 'Toyota Sienna'],
       [14, 27692.19, 82.84, 549.63, 27142.56, 0.0359, 'Toyota Sienna'],
       [15, 27142.56, 81.2, 551.27, 26591.29, 0.0359, 'Toyota Sienna'],
       [16, 26591.29, 79.55, 552.92, 26038.37, 0.0359, 'Toyota Sienna'],
       [17, 26038.37, 77.89, 554.58, 25483.79, 0.0359, 'Toyota Sienna'],
       [18, 25483.79, 76.23, 556.24, 24927.55, 0.0359, 'Toyota Sienna'],
       [19, 24927.55, 74.57, 557.9, 24369.65, 0.0359, 'Toyota Sienna'],
       [20, 24369.65, 72.9, 559.57, 23810.08, 0.0359, 'Toyota Sienna'],
       [21, 23810.08, 71.23, 561.24, 23248.84, 0.0359, 'Toyota Sienna'],
       [22, 23248.84, 69.55, 562.92, 22685.92, 0.0359, 'Toyota Sienna'],
       [23, 22685.92, 67.86, 564.61, 22121.31, 0.0359, 'Toyota Sienna'],
       [24, 22121.31, 66.17, 566.3, 21555.01, 0.0359, 'Toyota Sienna'],
       [25, 21555.01, 64.48, 567.99, 20987.02, 0.0359, 'Toyota Sienna'],
       [26, 20987.02, 62.78, 569.69, 20417.33, 0.0359, 'Toyota Sienna'],
       [27, 20417.33, 61.08, 571.39, 19845.94, 0.0359, 'Toyota Sienna'],
       [28, 19845.94, 59.37, 573.1, 19272.84, 0.0359, 'Toyota Sienna'],
       [29, 19272.84, 57.65, 574.82, 18698.02, 0.0359, 'Toyota Sienna'],
       [30, 18698.02, 55.93, 576.54, 18121.48, 0.0359, 'Toyota Sienna'],
       [31, 18121.48, 54.21, 578.26, 17543.22, 0.0359, 'Toyota Sienna'],
       [32, 17543.22, 52.48, 579.99, 16963.23, 0.0359, 'Toyota Sienna'],
       [33, 16963.23, 50.74, 581.73, 16381.5, 0.0359, 'Toyota Sienna'],
       [34, 16381.5, 49.0, 583.47, 15798.03, 0.0359, 'Toyota Sienna'],
       [35, 15798.03, 47.26, 585.21, 15212.82, 0.0359, 'Toyota Sienna'],
       [36, 15212.82, 45.51, 586.96, 14625.86, 0.0359, 'Toyota Sienna'],
       [37, 14625.86, 43.75, 588.72, 14037.14, 0.0359, 'Toyota Sienna'],
       [38, 14037.14, 41.99, 590.48, 13446.66, 0.0359, 'Toyota Sienna'],
       [39, 13446.66, 40.22, 592.25, 12854.41, 0.0359, 'Toyota Sienna'],
       [40, 12854.41, 38.45, 594.02, 12260.39, 0.0359, 'Toyota Sienna'],
       [41, 12260.39, 36.67, 595.8, 11664.59, 0.0359, 'Toyota Sienna'],
       [42, 11664.59, 34.89, 597.58, 11067.01, 0.0359, 'Toyota Sienna'],
       [43, 11067.01, 33.1, 599.37, 10467.64, 0.0359, 'Toyota Sienna'],
       [44, 10467.64, 31.31, 601.16, 9866.48, 0.0359, 'Toyota Sienna'],
       [45, 9866.48, 29.51, 602.96, 9263.52, 0.0359, 'Toyota Sienna'],
       [46, 9263.52, 27.71, 604.76, 8658.76, 0.0359, 'Toyota Sienna'],
       [47, 8658.76, 25.9, 606.57, 8052.19, 0.0359, 'Toyota Sienna'],
       [48, 8052.19, 24.08, 608.39, 7443.8, 0.0359, 'Toyota Sienna'],
       [49, 7443.8, 22.26, 610.21, 6833.59, 0.0359, 'Toyota Sienna'],
       [50, 6833.59, 20.44, 612.03, 6221.56, 0.0359, 'Toyota Sienna'],
       [51, 6221.56, 18.61, 613.86, 5607.7, 0.0359, 'Toyota Sienna'],
       [52, 5607.7, 16.77, 615.7, 4992.0, 0.0359, 'Toyota Sienna'],
       [53, 4992.0, 14.93, 617.54, 4374.46, 0.0359, 'Toyota Sienna'],
       [54, 4374.46, 13.08, 619.39, 3755.07, 0.0359, 'Toyota Sienna'],
       [55, 3755.07, 11.23, 621.24, 3133.83, 0.0359, 'Toyota Sienna'],
       [56, 3133.83, 9.37, 623.1, 2510.73, 0.0359, 'Toyota Sienna'],
       [57, 2510.73, 7.51, 624.96, 1885.77, 0.0359, 'Toyota Sienna'],
       [58, 1885.77, 5.64, 626.83, 1258.94, 0.0359, 'Toyota Sienna'],
       [59, 1258.94, 3.76, 628.71, 630.23, 0.0359, 'Toyota Sienna'],
       [60, 630.23, 1.88, 630.59, -0.36, 0.0359, 'Toyota Sienna']],
      dtype=object)

### Convert Pandas DataFrames to Dictionaries

In [81]:
df.to_dict()

{'month': {0: 1,
  1: 2,
  2: 3,
  3: 4,
  4: 5,
  5: 6,
  6: 7,
  7: 8,
  8: 9,
  9: 10,
  10: 11,
  11: 12,
  12: 13,
  13: 14,
  14: 15,
  15: 16,
  16: 17,
  17: 18,
  18: 19,
  19: 20,
  20: 21,
  21: 22,
  22: 23,
  23: 24,
  24: 25,
  25: 26,
  26: 27,
  27: 28,
  28: 29,
  29: 30,
  30: 31,
  31: 32,
  32: 33,
  33: 34,
  34: 35,
  35: 36,
  36: 37,
  37: 38,
  38: 39,
  39: 40,
  40: 41,
  41: 42,
  42: 43,
  43: 44,
  44: 45,
  45: 46,
  46: 47,
  47: 48,
  48: 49,
  49: 50,
  50: 51,
  51: 52,
  52: 53,
  53: 54,
  54: 55,
  55: 56,
  56: 57,
  57: 58,
  58: 59,
  59: 60,
  60: 1,
  61: 2,
  62: 3,
  63: 4,
  64: 5,
  65: 6,
  66: 7,
  67: 8,
  68: 9,
  69: 10,
  70: 11,
  71: 12,
  72: 13,
  73: 14,
  74: 15,
  75: 16,
  76: 17,
  77: 18,
  78: 19,
  79: 20,
  80: 21,
  81: 22,
  82: 23,
  83: 24,
  84: 25,
  85: 26,
  86: 27,
  87: 28,
  88: 29,
  89: 30,
  90: 31,
  91: 32,
  92: 33,
  93: 34,
  94: 35,
  95: 36,
  96: 37,
  97: 38,
  98: 39,
  99: 40,
  100: 41,
  101: 42,
  102: 43,
  103: 44,
  104: 45,
  105: 46,
  106: 47,
  107: 48,
  108: 49,
  109: 50,
  110: 51,
  111: 52,
  112: 53,
  113: 54,
  114: 55,
  115: 56,
  116: 57,
  117: 58,
  118: 59,
  119: 60},
 'starting_balance': {0: 34689.96,
  1: 34205.66,
  2: 33718.53,
  3: 33228.55,
  4: 32735.7,
  5: 32239.97,
  6: 31741.34,
  7: 31239.79,
  8: 30735.31,
  9: 30227.88,
  10: 29717.48,
  11: 29204.09,
  12: 28687.7,
  13: 28168.29,
  14: 27645.84,
  15: 27120.33,
  16: 26591.75,
  17: 26060.08,
  18: 25525.3,
  19: 24987.39,
  20: 24446.33,
  21: 23902.11,
  22: 23354.7,
  23: 22804.09,
  24: 22250.26,
  25: 21693.19,
  26: 21132.86,
  27: 20569.25,
  28: 20002.35,
  29: 19432.13,
  30: 18858.57,
  31: 18281.66,
  32: 17701.37,
  33: 17117.69,
  34: 16530.59,
  35: 15940.06,
  36: 15346.07,
  37: 14748.61,
  38: 14147.65,
  39: 13543.18,
  40: 12935.17,
  41: 12323.61,
  42: 11708.47,
  43: 11089.73,
  44: 10467.37,
  45: 9841.37,
  46: 9211.71,
  47: 8578.36,
  48: 7941.31,
  49: 7300.53,
  50: 6656.0,
  51: 6007.7,
  52: 5355.61,
  53: 4699.71,
  54: 4039.97,
  55: 3376.37,
  56: 2708.89,
  57: 2037.5,
  58: 1362.18,
  59: 682.91,
  60: 34689.96,
  61: 34161.27,
  62: 33630.99,
  63: 33099.13,
  64: 32565.68,
  65: 32030.63,
  66: 31493.98,
  67: 30955.72,
  68: 30415.85,
  69: 29874.37,
  70: 29331.27,
  71: 28786.54,
  72: 28240.18,
  73: 27692.19,
  74: 27142.56,
  75: 26591.29,
  76: 26038.37,
  77: 25483.79,
  78: 24927.55,
  79: 24369.65,
  80: 23810.08,
  81: 23248.84,
  82: 22685.92,
  83: 22121.31,
  84: 21555.01,
  85: 20987.02,
  86: 20417.33,
  87: 19845.94,
  88: 19272.84,
  89: 18698.02,
  90: 18121.48,
  91: 17543.22,
  92: 16963.23,
  93: 16381.5,
  94: 15798.03,
  95: 15212.82,
  96: 14625.86,
  97: 14037.14,
  98: 13446.66,
  99: 12854.41,
  100: 12260.39,
  101: 11664.59,
  102: 11067.01,
  103: 10467.64,
  104: 9866.48,
  105: 9263.52,
  106: 8658.76,
  107: 8052.19,
  108: 7443.8,
  109: 6833.59,
  110: 6221.56,
  111: 5607.7,
  112: 4992.0,
  113: 4374.46,
  114: 3755.07,
  115: 3133.83,
  116: 2510.73,
  117: 1885.77,
  118: 1258.94,
  119: 630.23},
 'interest_paid': {0: 202.93,
  1: 200.1,
  2: 197.25,
  3: 194.38,
  4: 191.5,
  5: 188.6,
  6: 185.68,
  7: 182.75,
  8: 179.8,
  9: 176.83,
  10: 173.84,
  11: 170.84,
  12: 167.82,
  13: 164.78,
  14: 161.72,
  15: 158.65,
  16: 155.56,
  17: 152.45,
  18: 149.32,
  19: 146.17,
  20: 143.01,
  21: 139.82,
  22: 136.62,
  23: 133.4,
  24: 130.16,
  25: 126.9,
  26: 123.62,
  27: 120.33,
  28: 117.01,
  29: 113.67,
  30: 110.32,
  31: 106.94,
  32: 103.55,
  33: 100.13,
  34: 96.7,
  35: 93.24,
  36: 89.77,
  37: 86.27,
  38: 82.76,
  39: 79.22,
  40: 75.67,
  41: 72.09,
  42: 68.49,
  43: 64.87,
  44: 61.23,
  45: 57.57,
  46: 53.88,
  47: 50.18,
  48: 46.45,
  49: 42.7,
  50: 38.93,
  51: 35.14,
  52: 31.33,
  53: 27.49,
  54: 23.63,
  55: 19.75,
  56: 15.84,
  57: 11.91,
  58: 7.96,
  59: 3.99,
  60: 103.78,
  61: 102.19,
  62: 100.61,
  63: 99.02,
  64: 97.42,
  65: 95.82,
  66: 94.21,
  67: 92.6,
  68: 90.99,
  69: 89.37,
  70: 87.74,
  71: 86.11,
  72: 84.48,
  73: 82.84,
  74: 81.2,
  75: 79.55,
  76: 77.89,
  77: 76.23,
  78: 74.57,
  79: 72.9,
  80: 71.23,
  81: 69.55,
  82: 67.86,
  83: 66.17,
  84: 64.48,
  85: 62.78,
  86: 61.08,
  87: 59.37,
  88: 57.65,
  89: 55.93,
  90: 54.21,
  91: 52.48,
  92: 50.74,
  93: 49.0,
  94: 47.26,
  95: 45.51,
  96: 43.75,
  97: 41.99,
  98: 40.22,
  99: 38.45,
  100: 36.67,
  101: 34.89,
  102: 33.1,
  103: 31.31,
  104: 29.51,
  105: 27.71,
  106: 25.9,
  107: 24.08,
  108: 22.26,
  109: 20.44,
  110: 18.61,
  111: 16.77,
  112: 14.93,
  113: 13.08,
  114: 11.23,
  115: 9.37,
  116: 7.51,
  117: 5.64,
  118: 3.76,
  119: 1.88},
 'principal_paid': {0: 484.3,
  1: 487.13,
  2: 489.98,
  3: 492.85,
  4: 495.73,
  5: 498.63,
  6: 501.55,
  7: 504.48,
  8: 507.43,
  9: 510.4,
  10: 513.39,
  11: 516.39,
  12: 519.41,
  13: 522.45,
  14: 525.51,
  15: 528.58,
  16: 531.67,
  17: 534.78,
  18: 537.91,
  19: 541.06,
  20: 544.22,
  21: 547.41,
  22: 550.61,
  23: 553.83,
  24: 557.07,
  25: 560.33,
  26: 563.61,
  27: 566.9,
  28: 570.22,
  29: 573.56,
  30: 576.91,
  31: 580.29,
  32: 583.68,
  33: 587.1,
  34: 590.53,
  35: 593.99,
  36: 597.46,
  37: 600.96,
  38: 604.47,
  39: 608.01,
  40: 611.56,
  41: 615.14,
  42: 618.74,
  43: 622.36,
  44: 626.0,
  45: 629.66,
  46: 633.35,
  47: 637.05,
  48: 640.78,
  49: 644.53,
  50: 648.3,
  51: 652.09,
  52: 655.9,
  53: 659.74,
  54: 663.6,
  55: 667.48,
  56: 671.39,
  57: 675.32,
  58: 679.27,
  59: 683.24,
  60: 528.69,
  61: 530.28,
  62: 531.86,
  63: 533.45,
  64: 535.05,
  65: 536.65,
  66: 538.26,
  67: 539.87,
  68: 541.48,
  69: 543.1,
  70: 544.73,
  71: 546.36,
  72: 547.99,
  73: 549.63,
  74: 551.27,
  75: 552.92,
  76: 554.58,
  77: 556.24,
  78: 557.9,
  79: 559.57,
  80: 561.24,
  81: 562.92,
  82: 564.61,
  83: 566.3,
  84: 567.99,
  85: 569.69,
  86: 571.39,
  87: 573.1,
  88: 574.82,
  89: 576.54,
  90: 578.26,
  91: 579.99,
  92: 581.73,
  93: 583.47,
  94: 585.21,
  95: 586.96,
  96: 588.72,
  97: 590.48,
  98: 592.25,
  99: 594.02,
  100: 595.8,
  101: 597.58,
  102: 599.37,
  103: 601.16,
  104: 602.96,
  105: 604.76,
  106: 606.57,
  107: 608.39,
  108: 610.21,
  109: 612.03,
  110: 613.86,
  111: 615.7,
  112: 617.54,
  113: 619.39,
  114: 621.24,
  115: 623.1,
  116: 624.96,
  117: 626.83,
  118: 628.71,
  119: 630.59},
 'new_balance': {0: 34205.66,
  1: 33718.53,
  2: 33228.55,
  3: 32735.7,
  4: 32239.97,
  5: 31741.34,
  6: 31239.79,
  7: 30735.31,
  8: 30227.88,
  9: 29717.48,
  10: 29204.09,
  11: 28687.7,
  12: 28168.29,
  13: 27645.84,
  14: 27120.33,
  15: 26591.75,
  16: 26060.08,
  17: 25525.3,
  18: 24987.39,
  19: 24446.33,
  20: 23902.11,
  21: 23354.7,
  22: 22804.09,
  23: 22250.26,
  24: 21693.19,
  25: 21132.86,
  26: 20569.25,
  27: 20002.35,
  28: 19432.13,
  29: 18858.57,
  30: 18281.66,
  31: 17701.37,
  32: 17117.69,
  33: 16530.59,
  34: 15940.06,
  35: 15346.07,
  36: 14748.61,
  37: 14147.65,
  38: 13543.18,
  39: 12935.17,
  40: 12323.61,
  41: 11708.47,
  42: 11089.73,
  43: 10467.37,
  44: 9841.37,
  45: 9211.71,
  46: 8578.36,
  47: 7941.31,
  48: 7300.53,
  49: 6656.0,
  50: 6007.7,
  51: 5355.61,
  52: 4699.71,
  53: 4039.97,
  54: 3376.37,
  55: 2708.89,
  56: 2037.5,
  57: 1362.18,
  58: 682.91,
  59: -0.33,
  60: 34161.27,
  61: 33630.99,
  62: 33099.13,
  63: 32565.68,
  64: 32030.63,
  65: 31493.98,
  66: 30955.72,
  67: 30415.85,
  68: 29874.37,
  69: 29331.27,
  70: 28786.54,
  71: 28240.18,
  72: 27692.19,
  73: 27142.56,
  74: 26591.29,
  75: 26038.37,
  76: 25483.79,
  77: 24927.55,
  78: 24369.65,
  79: 23810.08,
  80: 23248.84,
  81: 22685.92,
  82: 22121.31,
  83: 21555.01,
  84: 20987.02,
  85: 20417.33,
  86: 19845.94,
  87: 19272.84,
  88: 18698.02,
  89: 18121.48,
  90: 17543.22,
  91: 16963.23,
  92: 16381.5,
  93: 15798.03,
  94: 15212.82,
  95: 14625.86,
  96: 14037.14,
  97: 13446.66,
  98: 12854.41,
  99: 12260.39,
  100: 11664.59,
  101: 11067.01,
  102: 10467.64,
  103: 9866.48,
  104: 9263.52,
  105: 8658.76,
  106: 8052.19,
  107: 7443.8,
  108: 6833.59,
  109: 6221.56,
  110: 5607.7,
  111: 4992.0,
  112: 4374.46,
  113: 3755.07,
  114: 3133.83,
  115: 2510.73,
  116: 1885.77,
  117: 1258.94,
  118: 630.23,
  119: -0.36},
 'interest_rate': {0: 0.0702,
  1: 0.0702,
  2: 0.0702,
  3: 0.0702,
  4: 0.0702,
  5: 0.0702,
  6: 0.0702,
  7: 0.0702,
  8: 0.0702,
  9: 0.0702,
  10: 0.0702,
  11: 0.0702,
  12: 0.0702,
  13: 0.0702,
  14: 0.0702,
  15: 0.0702,
  16: 0.0702,
  17: 0.0702,
  18: 0.0702,
  19: 0.0702,
  20: 0.0702,
  21: 0.0702,
  22: 0.0702,
  23: 0.0702,
  24: 0.0702,
  25: 0.0702,
  26: 0.0702,
  27: 0.0702,
  28: 0.0702,
  29: 0.0702,
  30: 0.0702,
  31: 0.0702,
  32: 0.0702,
  33: 0.0702,
  34: 0.0702,
  35: 0.0702,
  36: 0.0702,
  37: 0.0702,
  38: 0.0702,
  39: 0.0702,
  40: 0.0702,
  41: 0.0702,
  42: 0.0702,
  43: 0.0702,
  44: 0.0702,
  45: 0.0702,
  46: 0.0702,
  47: 0.0702,
  48: 0.0702,
  49: 0.0702,
  50: 0.0702,
  51: 0.0702,
  52: 0.0702,
  53: 0.0702,
  54: 0.0702,
  55: 0.0702,
  56: 0.0702,
  57: 0.0702,
  58: 0.0702,
  59: 0.0702,
  60: 0.0359,
  61: 0.0359,
  62: 0.0359,
  63: 0.0359,
  64: 0.0359,
  65: 0.0359,
  66: 0.0359,
  67: 0.0359,
  68: 0.0359,
  69: 0.0359,
  70: 0.0359,
  71: 0.0359,
  72: 0.0359,
  73: 0.0359,
  74: 0.0359,
  75: 0.0359,
  76: 0.0359,
  77: 0.0359,
  78: 0.0359,
  79: 0.0359,
  80: 0.0359,
  81: 0.0359,
  82: 0.0359,
  83: 0.0359,
  84: 0.0359,
  85: 0.0359,
  86: 0.0359,
  87: 0.0359,
  88: 0.0359,
  89: 0.0359,
  90: 0.0359,
  91: 0.0359,
  92: 0.0359,
  93: 0.0359,
  94: 0.0359,
  95: 0.0359,
  96: 0.0359,
  97: 0.0359,
  98: 0.0359,
  99: 0.0359,
  100: 0.0359,
  101: 0.0359,
  102: 0.0359,
  103: 0.0359,
  104: 0.0359,
  105: 0.0359,
  106: 0.0359,
  107: 0.0359,
  108: 0.0359,
  109: 0.0359,
  110: 0.0359,
  111: 0.0359,
  112: 0.0359,
  113: 0.0359,
  114: 0.0359,
  115: 0.0359,
  116: 0.0359,
  117: 0.0359,
  118: 0.0359,
  119: 0.0359},
 'car_type': {0: 'Toyota Sienna',
  1: 'Toyota Sienna',
  2: 'Toyota Sienna',
  3: 'Toyota Sienna',
  4: 'Toyota Sienna',
  5: 'Toyota Sienna',
  6: 'Toyota Sienna',
  7: 'Toyota Sienna',
  8: 'Toyota Sienna',
  9: 'Toyota Sienna',
  10: 'Toyota Sienna',
  11: 'Toyota Sienna',
  12: 'Toyota Sienna',
  13: 'Toyota Sienna',
  14: 'Toyota Sienna',
  15: 'Toyota Sienna',
  16: 'Toyota Sienna',
  17: 'Toyota Sienna',
  18: 'Toyota Sienna',
  19: 'Toyota Sienna',
  20: 'Toyota Sienna',
  21: 'Toyota Sienna',
  22: 'Toyota Sienna',
  23: 'Toyota Sienna',
  24: 'Toyota Sienna',
  25: 'Toyota Sienna',
  26: 'Toyota Sienna',
  27: 'Toyota Sienna',
  28: 'Toyota Sienna',
  29: 'Toyota Sienna',
  30: 'Toyota Sienna',
  31: 'Toyota Sienna',
  32: 'Toyota Sienna',
  33: 'Toyota Sienna',
  34: 'Toyota Sienna',
  35: 'Toyota Sienna',
  36: 'Toyota Sienna',
  37: 'Toyota Sienna',
  38: 'Toyota Sienna',
  39: 'Toyota Sienna',
  40: 'Toyota Sienna',
  41: 'Toyota Sienna',
  42: 'Toyota Sienna',
  43: 'Toyota Sienna',
  44: 'Toyota Sienna',
  45: 'Toyota Sienna',
  46: 'Toyota Sienna',
  47: 'Toyota Sienna',
  48: 'Toyota Sienna',
  49: 'Toyota Sienna',
  50: 'Toyota Sienna',
  51: 'Toyota Sienna',
  52: 'Toyota Sienna',
  53: 'Toyota Sienna',
  54: 'Toyota Sienna',
  55: 'Toyota Sienna',
  56: 'Toyota Sienna',
  57: 'Toyota Sienna',
  58: 'Toyota Sienna',
  59: 'Toyota Sienna',
  60: 'Toyota Sienna',
  61: 'Toyota Sienna',
  62: 'Toyota Sienna',
  63: 'Toyota Sienna',
  64: 'Toyota Sienna',
  65: 'Toyota Sienna',
  66: 'Toyota Sienna',
  67: 'Toyota Sienna',
  68: 'Toyota Sienna',
  69: 'Toyota Sienna',
  70: 'Toyota Sienna',
  71: 'Toyota Sienna',
  72: 'Toyota Sienna',
  73: 'Toyota Sienna',
  74: 'Toyota Sienna',
  75: 'Toyota Sienna',
  76: 'Toyota Sienna',
  77: 'Toyota Sienna',
  78: 'Toyota Sienna',
  79: 'Toyota Sienna',
  80: 'Toyota Sienna',
  81: 'Toyota Sienna',
  82: 'Toyota Sienna',
  83: 'Toyota Sienna',
  84: 'Toyota Sienna',
  85: 'Toyota Sienna',
  86: 'Toyota Sienna',
  87: 'Toyota Sienna',
  88: 'Toyota Sienna',
  89: 'Toyota Sienna',
  90: 'Toyota Sienna',
  91: 'Toyota Sienna',
  92: 'Toyota Sienna',
  93: 'Toyota Sienna',
  94: 'Toyota Sienna',
  95: 'Toyota Sienna',
  96: 'Toyota Sienna',
  97: 'Toyota Sienna',
  98: 'Toyota Sienna',
  99: 'Toyota Sienna',
  100: 'Toyota Sienna',
  101: 'Toyota Sienna',
  102: 'Toyota Sienna',
  103: 'Toyota Sienna',
  104: 'Toyota Sienna',
  105: 'Toyota Sienna',
  106: 'Toyota Sienna',
  107: 'Toyota Sienna',
  108: 'Toyota Sienna',
  109: 'Toyota Sienna',
  110: 'Toyota Sienna',
  111: 'Toyota Sienna',
  112: 'Toyota Sienna',
  113: 'Toyota Sienna',
  114: 'Toyota Sienna',
  115: 'Toyota Sienna',
  116: 'Toyota Sienna',
  117: 'Toyota Sienna',
  118: 'Toyota Sienna',
  119: 'Toyota Sienna'}}

## **Export pandas DataFrames to CSV and Excel files**

In [82]:
# Export DataFrame to csv File
df.to_csv(path_or_buf='data/table.csv',
          index_label=False)

In [83]:
# Export DataFrame to excel File
df.to_excel(excel_writer='data/table.xlsx',
            index=False)